## Impiort SQLite3

In [1]:
import sqlite3 as sql3

## Connecting To Database

In [2]:
conn = sql3.connect('database.sqlite3')
print(conn)
conn.close()

<sqlite3.Connection object at 0x00000294990D8120>

## Create Table

In [3]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute("""DROP TABLE IF EXISTS student """)
    cursor.execute(
        """CREATE TABLE student(roll int PRIMARY KEY, name CHAR(25), age INT, email VARCHAR(30)) """
    )
    conn.commit()

## Show Table

In [4]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    tab = cursor.execute(
        """SELECT name FROM sqlite_schema where type = 'table' ORDER BY name """
    )
    print(cursor.fetchall())
    # print(list(tab))
    conn.commit()

[('student',)]

## Adding ROWS

In [5]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """INSERT INTO student VALUES(?,?,?,?) """,
        (101,"Raihan Sikdar",25,"raihansikdar10@gmail.com")
    )
    conn.commit()

In [6]:
users = [ 
          (102, 'John Smith', 27, 'john@gmail.com'),
          (103, "Alexa Jones", 23, "alexa@gmail.com"),
          (104, "Alley P", 26, "alley@yahoo.com"),
          (105, "John S", 27, "john@gmail.com"),
          (106, "Babar Azam", 30, "babarazam@gmail.com"),
          (107, "Afridi", 29, "afridi@gmail.com"),
          (108, "Nasir", 24, "Nasir@yahoo.com"),
]

with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.executemany(
        """INSERT INTO student VALUES(?,?,?,?)""",users
    )
    conn.commit()

## SELECT info

In [7]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student """,
    )
    for i in res:
        print(i)

(101, 'Raihan Sikdar', 25, 'raihansikdar10@gmail.com')
(102, 'John Smith', 27, 'john@gmail.com')
(103, 'Alexa Jones', 23, 'alexa@gmail.com')
(104, 'Alley P', 26, 'alley@yahoo.com')
(105, 'John S', 27, 'john@gmail.com')
(106, 'Babar Azam', 30, 'babarazam@gmail.com')
(107, 'Afridi', 29, 'afridi@gmail.com')
(108, 'Nasir', 24, 'Nasir@yahoo.com')

Searching roll and name

In [8]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT roll,name, AVG(age) FROM student """,
    )

    print(list(res))

[(101, 'Raihan Sikdar', 26.375)]

In [9]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student """,
    ).fetchone()
    print(list(res))

[101, 'Raihan Sikdar', 25, 'raihansikdar10@gmail.com']

In [10]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student """,
    ).fetchmany(3)
    print(list(res))

[(101, 'Raihan Sikdar', 25, 'raihansikdar10@gmail.com'), (102, 'John Smith', 27, 'john@gmail.com'), (103, 'Alexa Jones', 23, 'alexa@gmail.com')]

## Updating row

In [11]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """UPDATE student SET roll=?, name=?, email=? WHERE roll=? """,
        (115,'AL Mamun',"almamun10@gmail.com",105)
    )
    conn.commit()

In [12]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student """,
    )
    for i in res:
        print(i)
    #print(list(res))
    conn.commit()

(101, 'Raihan Sikdar', 25, 'raihansikdar10@gmail.com')
(102, 'John Smith', 27, 'john@gmail.com')
(103, 'Alexa Jones', 23, 'alexa@gmail.com')
(104, 'Alley P', 26, 'alley@yahoo.com')
(115, 'AL Mamun', 27, 'almamun10@gmail.com')
(106, 'Babar Azam', 30, 'babarazam@gmail.com')
(107, 'Afridi', 29, 'afridi@gmail.com')
(108, 'Nasir', 24, 'Nasir@yahoo.com')

In [13]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """UPDATE student SET age=? WHERE roll IN (?,?)""",
        (26,101,102)
    )
    conn.commit()

In [14]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student """,
    )
    for i in res:
        print(i)
    # print(list(res))
    conn.commit()

(101, 'Raihan Sikdar', 26, 'raihansikdar10@gmail.com')
(102, 'John Smith', 26, 'john@gmail.com')
(103, 'Alexa Jones', 23, 'alexa@gmail.com')
(104, 'Alley P', 26, 'alley@yahoo.com')
(115, 'AL Mamun', 27, 'almamun10@gmail.com')
(106, 'Babar Azam', 30, 'babarazam@gmail.com')
(107, 'Afridi', 29, 'afridi@gmail.com')
(108, 'Nasir', 24, 'Nasir@yahoo.com')

## Deleting a Row

In [15]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """DELETE FROM student WHERE roll=? """,(115,)
    )
    conn.commit()

In [16]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student """,
    )
    for i in res:
        print(i)
    # print(list(res))
    conn.commit()

(101, 'Raihan Sikdar', 26, 'raihansikdar10@gmail.com')
(102, 'John Smith', 26, 'john@gmail.com')
(103, 'Alexa Jones', 23, 'alexa@gmail.com')
(104, 'Alley P', 26, 'alley@yahoo.com')
(106, 'Babar Azam', 30, 'babarazam@gmail.com')
(107, 'Afridi', 29, 'afridi@gmail.com')
(108, 'Nasir', 24, 'Nasir@yahoo.com')

## WHERE Clause

In [17]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student WHERE age>? """,(25,)
    )
    print(list(res))

[(101, 'Raihan Sikdar', 26, 'raihansikdar10@gmail.com'), (102, 'John Smith', 26, 'john@gmail.com'), (104, 'Alley P', 26, 'alley@yahoo.com'), (106, 'Babar Azam', 30, 'babarazam@gmail.com'), (107, 'Afridi', 29, 'afridi@gmail.com')]

## AND , OR, NOT, IN

In [18]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student WHERE age>? AND NOT roll>=?""", (25, 101)
    )
    print(list(res))

[]

In [19]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student WHERE age>? AND roll>=?""", (25, 101)
    )
    for i in res:
        print(i)
    
    # print(list(res))

(101, 'Raihan Sikdar', 26, 'raihansikdar10@gmail.com')
(102, 'John Smith', 26, 'john@gmail.com')
(104, 'Alley P', 26, 'alley@yahoo.com')
(106, 'Babar Azam', 30, 'babarazam@gmail.com')
(107, 'Afridi', 29, 'afridi@gmail.com')

## Wild Cards with LIKE

In [20]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student WHERE name LIKE '_%r'""",
    )
    print(list(res))

[(101, 'Raihan Sikdar', 26, 'raihansikdar10@gmail.com'), (108, 'Nasir', 24, 'Nasir@yahoo.com')]

In [21]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student WHERE name LIKE 'A%'""",
    )
    print(list(res))

[(103, 'Alexa Jones', 23, 'alexa@gmail.com'), (104, 'Alley P', 26, 'alley@yahoo.com'), (107, 'Afridi', 29, 'afridi@gmail.com')]

In [22]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student WHERE name LIKE '_a%_'""",
    )
    for i in res:
        print(i)
    # print(list(res))

(101, 'Raihan Sikdar', 26, 'raihansikdar10@gmail.com')
(106, 'Babar Azam', 30, 'babarazam@gmail.com')
(108, 'Nasir', 24, 'Nasir@yahoo.com')

## Aggregate Function

In [23]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT MAX(age),MIN(age),AVG(age),SUM(age),COUNT(*) FROM student""",
    )
    print(list(res))

[(30, 23, 26.285714285714285, 184, 7)]

## Group BY

In [24]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT COUNT(*), age FROM student GROUP BY age""",
    )
    print(list(res))

[(1, 23), (1, 24), (3, 26), (1, 29), (1, 30)]

## ORDER BY

In [25]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res = cursor.execute(
        """SELECT * FROM student ORDER BY age DESC,roll DESC"""
    )

    for i in res:
         print(i)
    conn.commit()

(106, 'Babar Azam', 30, 'babarazam@gmail.com')
(107, 'Afridi', 29, 'afridi@gmail.com')
(104, 'Alley P', 26, 'alley@yahoo.com')
(102, 'John Smith', 26, 'john@gmail.com')
(101, 'Raihan Sikdar', 26, 'raihansikdar10@gmail.com')
(108, 'Nasir', 24, 'Nasir@yahoo.com')
(103, 'Alexa Jones', 23, 'alexa@gmail.com')

# Create Another Table

In [26]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.execute("""DROP TABLE IF EXISTS result""")
    cursor.execute(
        """CREATE TABLE result (roll INT PRIMARY KEY,dept VARCHAR(30),cgpa float) """
    )
    conn.commit()

# Insert Value

In [27]:
users = [
    (101,'CSE',3.80),
    (102,'CSE',3.85),
    (103,'ENG',3.92),
    (104,'EEE',3.75),
    (106,'EEE',3.65),
    (107,'MATH',3.90)
]

with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    cursor.executemany(
        """INSERT INTO result VALUES(?,?,?)""",users
    )
    conn.commit()

# Shows Value

In [28]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res=cursor.execute(
        """SELECT * FROM result"""
    )
    for i in res:
        print(i)

(101, 'CSE', 3.8)
(102, 'CSE', 3.85)
(103, 'ENG', 3.92)
(104, 'EEE', 3.75)
(106, 'EEE', 3.65)
(107, 'MATH', 3.9)

# Join Table

In [29]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res=cursor.execute(
        """SELECT student.roll,name,dept,cgpa 
           FROM student,result
           WHERE student.roll = result.roll"""
    )
    for i in res:
        print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

# Join Clause

In [30]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res=cursor.execute(
        """SELECT student.roll,name,dept,cgpa 
           FROM student JOIN result
           ON student.roll = result.roll"""
    )
    for i in res:
        print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

# Inner Join

In [31]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res=cursor.execute(
        """SELECT student.roll,name,dept,cgpa 
           FROM student INNER JOIN result
           ON student.roll = result.roll"""
    )
    for i in res:
        print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)

# Left Join

In [32]:
with sql3.connect('database.sqlite3') as conn:
    cursor = conn.cursor()
    res=cursor.execute(
        """SELECT student.roll,name,dept,cgpa 
           FROM student LEFT JOIN result
           ON student.roll = result.roll"""
    )
    for i in res:
        print(i)

(101, 'Raihan Sikdar', 'CSE', 3.8)
(102, 'John Smith', 'CSE', 3.85)
(103, 'Alexa Jones', 'ENG', 3.92)
(104, 'Alley P', 'EEE', 3.75)
(106, 'Babar Azam', 'EEE', 3.65)
(107, 'Afridi', 'MATH', 3.9)
(108, 'Nasir', None, None)

## Deleting Table

In [33]:
# with sql3.connect('database.sqlite3') as conn:
#     cursor = conn.cursor()
#     cursor.execute(
#         """DROP TABLE student""",
#     )
#     conn.commit()

In [34]:
# https://www.sqlite.org/lang.html

In [35]:
# https://sqliteonline.com/